**Edycja nazw kolumn, indeksu, kopiowanie data frame**

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import math

In [3]:
frame = pd.read_csv('C:/Users/Mariusz Baran/Data_Science_kurs/Data_science_pliki/course-files/mammals.csv')
frame.head()

              name     body  brain
0       Arctic fox    3.385   44.5
1       Owl monkey    0.480   15.5
2  Mountain beaver    1.350    8.1
3              Cow  465.000  423.0
4        Grey wolf   36.330  119.5

Zmiana nazw kolumn

In [4]:
frame.columns

Index(['name', 'body', 'brain'], dtype='object')

In [7]:
frame.columns = ['name', 'bodyKg', 'brainKg']

In [8]:
frame.head()

              name   bodyKg  brainKg
0       Arctic fox    3.385     44.5
1       Owl monkey    0.480     15.5
2  Mountain beaver    1.350      8.1
3              Cow  465.000    423.0
4        Grey wolf   36.330    119.5

Jeśli mamy bardzo dużo kolumn można użyć słownika i zamienić tylko te, które chcemy i użyć metody rename()

In [9]:
new_columns = {'bodyKg': 'body_kg', 'brainKg': 'brain_kg'}

In [11]:
frame.rename(columns=new_columns, inplace=True)
frame.head()

              name  body_kg  brain_kg
0       Arctic fox    3.385      44.5
1       Owl monkey    0.480      15.5
2  Mountain beaver    1.350       8.1
3              Cow  465.000     423.0
4        Grey wolf   36.330     119.5

In [12]:
frame = pd.read_csv('C:/Users/Mariusz Baran/Data_Science_kurs/Data_science_pliki/course-files/mammals.csv',
                   index_col='name')
frame.head()

                    body  brain
name
Arctic fox         3.385   44.5
Owl monkey         0.480   15.5
Mountain beaver    1.350    8.1
Cow              465.000  423.0
Grey wolf         36.330  119.5

Zmiana wartości indeksu

In [13]:
frame.rename(index={'Cow': 'Krowa'}, inplace=True)
frame.head()

                    body  brain
name
Arctic fox         3.385   44.5
Owl monkey         0.480   15.5
Mountain beaver    1.350    8.1
Krowa            465.000  423.0
Grey wolf         36.330  119.5

Kopia data frame

metoda copy() tworzy nowy data frame, którego modyfikacja nie wpływa na orginalny

In [14]:
frame_copy = frame.copy()

In [16]:
frame_copy.loc['Grey wolf', 'body'] = 40
frame_copy.head()

                    body  brain
name
Arctic fox         3.385   44.5
Owl monkey         0.480   15.5
Mountain beaver    1.350    8.1
Krowa            465.000  423.0
Grey wolf         40.000  119.5

In [17]:
frame.head()

                    body  brain
name
Arctic fox         3.385   44.5
Owl monkey         0.480   15.5
Mountain beaver    1.350    8.1
Krowa            465.000  423.0
Grey wolf         36.330  119.5